#Из фразы 'Кабачки полезны для здоровья.' получите слово Клад.
#Результат работы программы должен выглядеть так:
#  К
#  л
#  а
#  д
example_str = 'Кабачки полезны для здоровья.'

# Напишите свой код здесь.
print(example_str[0])
print(example_str[10])
print(example_str[-26])
print(example_str[-8])